Repository: Ansa89/gTox
Catalog: Source/Locale/*.po
Languages: es, ru

# ABOUT_SOFTWARE_COPYRIGHT
source: Copyright Â© 2014 - the gTox team
es: Copyright © 2014 - El equipo gTox
ru: Copyright © 2014 - the gTox team

# ABOUT_SOFTWARE_VERSION
source: <i>pre-alpha version</i>
es: <i>Versión pre-alpha</i>

# ABOUT_SOFTWARE_WARRANTY
source: <i>This program comes with ABSOLUTELY NO WARRANTY</i>
es: <i>Este programa viene ABSOLUTAMENTE SIN NINGUNA GARANTÍA</i>

# ASSISTANT_FILE_GTOX
source: gTox file
es: Archivo gTox
ru: Файл gTox

# ASSISTANT_FILE_TEXT
source: <span size='x-small'><u>toxcore file</u> includes the profile and contact list, <u>gTox file</u> includes the chat log and gTox specified settings. <b>If you do a backup you must at least backup the <u>toxcore file</u> !</b></span>
es: <span size='x-small'><u>Archivo toxcore</u> incluye el perfil y la lista de contactos, <u>Archivo gTox</u> incluye el registro de chat y la configuración de gTox. <b>Si usted desea hacer una copia de seguridad del perfil, en primer lugar <u>Guarde el archivo toxcore</u> !</b></span>
ru: <span size='x-small'><u>Файл toxcore</u> содержит профиль и список контактов, <u>файл gTox</u> включает в себя историю сообщений и настройки gTox. <b>Если вы хотите сделать резервную копию профиля, то в первую очередь сохраните <u>файл toxcore</u> !</b></span>

# ASSISTANT_FILE_TOX
source: toxcore file
es: Archivo toxcore
ru: файл toxcore

# ASSISTANT_LOGGING
source: Chat logging
es: Mantener historial de mensajes
ru: Хранить историю сообщений

# ASSISTANT_LOGGING_TEXT
source: <span size='x-small'>gTox saves the log into a uncrypted SqliteDB</span>
es: <span size='x-small'>gTox guarda el registro en SqliteDB no cifrado</span>
ru: <span size='x-small'>gTox сохраняет историю в незашифрованную базу дынных Sqlite</span>

# ASSISTANT_STATUSMESSAGE
source: Status message
es: Mensaje de Estado
ru: Статусное сообщение

# ASSISTANT_USERNAME
source: Name
es: Nombre
ru: Имя

# ASSISTANT_WELCOME_TEXT
source: Wellcome to gTox gTox and Tox are by no means complete. We cannot guarantee what works today will work tomorrow. gTox and Tox are alpha software and code changes daily.
es: Bienvenido a gTox gTox y Tox están de ninguna manera completos. No podemos garantizar que lo que funciona hoy funcionará mañana. gTox y Tox son software de código alfa y cambia todos los días.
ru: Добро пожаловать в gTox gTox и Tox находятся в стадии активной разработки. Мы не может гарантировать то, что сегодня прекрасно работает будет так же работать и завтра. gTox и Tox находят в стадии альфа-версии и кодовая база обоих проектом может меняться ежедневно.

source: Away
es: Ausente
ru: Ушёл

source: Busy
es: Ocupado
ru: Занят

# ERROR_ADD_CONTACT_ADDR_WRONG_SIZE
source: A tox id must be 76 letters long
es: Una ID Tox debe ser 76 letras de largo
ru: Длина Tox ID должны быть 76 символов

# ERROR_ADD_CONTACT_ADDR_WRONG_SIZE_TITLE
source: Wrong ID length
es: Longitud ID incorrecta
ru: Неверная длина ID

# ERROR_REPORT_BTN
source: Report
es: Reportar
ru: Сообщить разработчику

# ERROR_REPORT_TEXT_INTRO
source: gTox can't continue. The following problem occured: <i><b>
es: gTox no puede continuar. El siguiente problema ha ocurrido: <i><b>
ru: Произошла фатальная ошибка в программе: <i><b>

# ERROR_REPORT_TEXT_OUTRO
source: </b></i> Please make sure that you are using the newest gTox version. If you do use the newest, please report the error to us.
es: </b></i> Por favor, asegúrese de que está utilizando la versión más reciente gTox. Si usted hace uso de la más reciente, por favor infórmenos del error.
ru: </b></i> Убедитесь, что вы используете последнюю версию gTox. Если это так, то дайте нам знать о случившейся ошибке программы.

source: Exit
es: Salir
ru: Выход

source: Ignore
es: Ignorar

source: Online
es: Disponible
ru: Доступен

# PROFILE_CORRUPTED
source: Profile couldn't be loaded
es: Perfil no se pudo cargar
ru: Невозможно загрузить профиль

# PROFILE_CORRUPTED_TITLE
source: Corrupted profile
es: Perfil Corrupto
ru: Повреждённый профиль

# PROFILE_LOADING
source: loading profiles...
es: Cargando perfiles...

# PROFILE_NEW
source: New
es: Nuevo
ru: Новый

# PROFILE_OPEN_SETTINGS
source: Settings
es: Configuración
ru: Настройки

# PROFILE_SELECT
source: Select
es: Seleccionar
ru: Выбрать

# PROFILE_STATUSMESSAGE
source: Message
es: Mensaje
ru: Статусное сообщение

# PROFILE_SUBTITLE
source: Select profile
es: Seleccionar Perfil
ru: Выбор профиля

# PROFILE_USERNAME
source: Username
es: Nombre
ru: Имя

source: Remove
es: Eliminar
ru: Удалить

source: Send
es: Enviar
ru: Отправить

# SETTINGS_ABOUT
source: About
es: Acerca de
ru: О программе

# SETTINGS_CACHE_CLEAN_LOG
source: You are about to remove all conversations logs of all contacts. This action cannot be undone !
es: Estás a punto de eliminar todos los registros de las conversaciones de todos los contactos. Esta acción no se puede deshacer !
ru: Вы собираетесь удалить историю переписки со всеми контактами. В дальнейшем действие не может быть отменено! Продолжить?

# SETTINGS_CACHE_CLEAN_LOG_SUCCESS
source: %1 log entries successfully removed
es: %1 entradas de registro eliminado con éxito.
ru: %1 сообщений удалено

# SETTINGS_CACHE_CLEAN_LOG_SUCCESS_TITLE
source: Logs removed
es: Historial eliminado.
ru: История переписки очищена

# SETTINGS_CACHE_CLEAN_LOG_TITLE
source: Delete all logs ?
es: ¿Desea eliminar todo el historial?
ru: Удалить всю историю ?

# SETTINGS_TITLE
source: gTox settings
es: Configuración gTox
ru: Найтройка gTox

# TOX_ERR_BOOTSTRAP_BAD_HOST
source: TOX_ERR_BOOTSTRAP_BAD_HOST The host could not be resolved to an IP address, or the IP address passed was invalid.
es: TOX_ERR_BOOTSTRAP_BAD_HOST El host no se pudo resolver en la dirección IP o la dirección IP introducida no era válida.
ru: TOX_ERR_BOOTSTRAP_BAD_HOST Невозможно преобразовать имя сервера в IP-адрес, или был использован не верный IP-адрес.

# TOX_ERR_BOOTSTRAP_BAD_PORT
source: TOX_ERR_BOOTSTRAP_BAD_PORT The port passed was invalid. The valid port range is (1, 65535).
es: TOX_ERR_BOOTSTRAP_BAD_PORT El puerto introducido no es válido. El rango de puerto válido es (1, 65535).
ru: TOX_ERR_BOOTSTRAP_BAD_PORT Неверный номер порта. Номер порта должен находиться в пределах от 1 до 65535.

# TOX_ERR_FRIEND_ADD_ALREADY_SENT
source: TOX_ERR_FRIEND_ADD_ALREADY_SENT A friend request has already been sent, or the address belongs to a friend that is already on the friend list.
es: TOX_ERR_FRIEND_ADD_ALREADY_SENT Una solicitud de amistad ya ha sido enviado, o la dirección pertenece a un amigo que ya está en la lista de amigos.
ru: TOX_ERR_FRIEND_ADD_ALREADY_SENT Запрос на добавление уже был отправлен или адрес уже присутствует в контакт-листе.

# TOX_ERR_FRIEND_ADD_ALREADY_SENT_UI
source: A friend request has already been sent, or the address belongs to a friend that is already on the friend list.
es: Una solicitud de amistad ya ha sido enviado, o la dirección pertenece a un amigo que ya está en la lista de amigos.
ru: Запрос на добавление уже был отправлен или адрес уже присутствует в контакт-листе.

# TOX_ERR_FRIEND_ADD_ALREADY_SENT_UI_TITLE
source: Friend request failed
es: Solicitud de amistad ha fallado
ru: Запрос на добавление уже отправлен

# TOX_ERR_FRIEND_ADD_BAD_CHECKSUM
source: TOX_ERR_FRIEND_ADD_BAD_CHECKSUM The friend address checksum failed.
es: TOX_ERR_FRIEND_ADD_BAD_CHECKSUM La dirección amigo checksum falló.
ru: TOX_ERR_FRIEND_ADD_BAD_CHECKSUM Неверная контрольная сумма адреса контакта.

# TOX_ERR_FRIEND_ADD_BAD_CHECKSUM_UI
source: The friend address checksum failed.
es: La dirección amigo checksum falló.
ru: Неверная контрольная сумма адреса контакта.

# TOX_ERR_FRIEND_ADD_BAD_CHECKSUM_UI_TITLE
source: Wrong checksum
es: Checksum incorrecto
ru: Неверная контрольная сумма

# TOX_ERR_FRIEND_ADD_MALLOC
source: TOX_ERR_FRIEND_ADD_MALLOC A memory allocation failed when trying to increase the friend list size.
es: TOX_ERR_FRIEND_ADD_MALLOC Una asignación de memoria falló al tratar de aumentar el tamaño de la lista amigo.
ru: TOX_ERR_FRIEND_ADD_MALLOC Невозможно выделить память для добавления в контакт-лист.

# TOX_ERR_FRIEND_ADD_NO_MESSAGE
source: TOX_ERR_FRIEND_ADD_NO_MESSAGE The friend request message was empty. This, and the TOO_LONG code will never be returned from tox_friend_add_norequest.
es: TOX_ERR_FRIEND_ADD_NO_MESSAGE El mensaje de solicitud de amistad estaba vacío. Esto, y el código TOO_LONG nunca será regresó de tox_friend_add_norequest.
ru: TOX_ERR_FRIEND_ADD_NO_MESSAGE Текст запроса на добавление было пустым. Это сообщение и сообщение TOO_LONG code никогда не будет вызвано из функции tox_friend_add_norequest.

# TOX_ERR_FRIEND_ADD_NO_MESSAGE_UI
source: The friend request message is not allowed to be empty.
es: El mensaje de solicitud de amistad no se permite el campo vacío.
ru: Сообщение при запросе на добавление не должно быть пустым.

# TOX_ERR_FRIEND_ADD_NO_MESSAGE_UI_TITLE
source: Empty message
es: Mensaje vacío
ru: Пустое сообщение запроса на добавление

# TOX_ERR_FRIEND_ADD_OWN_KEY
source: TOX_ERR_FRIEND_ADD_OWN_KEY The friend address belongs to the sending client.
es: TOX_ERR_FRIEND_ADD_OWN_KEY La dirección amigo pertenece al cliente que envía.
ru: TOX_ERR_FRIEND_ADD_OWN_KEY Вы не можете добавить себя в свой же контакт-лист.

# TOX_ERR_FRIEND_ADD_OWN_KEY_UI
source: The friend address belongs to you
es: La dirección amigo le pertenece a usted
ru: Адрес контакта для добавления принадлежит вам

# TOX_ERR_FRIEND_ADD_OWN_KEY_UI_TITLE
source: Friend request failed
es: Solicitud de amistad ha fallado
ru: Невозможно добавить контакт

# TOX_ERR_FRIEND_ADD_SET_NEW_NOSPAM
source: TOX_ERR_FRIEND_ADD_SET_NEW_NOSPAM The friend was already there, but the nospam value was different.
es: TOX_ERR_FRIEND_ADD_SET_NEW_NOSPAM El amigo ya estaba allí, pero el valor nospam era diferente.
ru: TOX_ERR_FRIEND_ADD_SET_NEW_NOSPAM Контакт уже добавлен, но с другим значением nospam.

# TOX_ERR_FRIEND_ADD_SET_NEW_NOSPAM_UI
source: The friend was already there, but the nospam value was different.
es: El amigo ya estaba allí, pero el valor nospam era diferente.
ru: Контакт уже добавлен, но с другим значением nospam.

# TOX_ERR_FRIEND_ADD_SET_NEW_NOSPAM_UI_TITLE
source: Friend request failed
es: Solicitud de amistad ha fallado
ru: Невозможно добавить контакт

# TOX_ERR_FRIEND_ADD_TOO_LONG
source: TOX_ERR_FRIEND_ADD_TOO_LONG The length of the friend request message exceeded TOX_MAX_FRIEND_REQUEST_LENGTH.
es: TOX_ERR_FRIEND_ADD_TOO_LONG La longitud del mensaje de la solicitud de amistad superada TOX_MAX_FRIEND_REQUEST_LENGTH.
ru: TOX_ERR_FRIEND_ADD_TOO_LONG Длина сообщения запроса на добавление привысила TOX_MAX_FRIEND_REQUEST_LENGTH.

# TOX_ERR_FRIEND_ADD_TOO_LONG_UI
source: The length of the friend request message exceeded 1016 bytes.
es: La longitud del mensaje de la solicitud de amistad ha superado 1016 bytes.
ru: Длина сообщения запроса на добавление привысила 1016 байт.

# TOX_ERR_FRIEND_ADD_TOO_LONG_UI_TITLE
source: Friend request failed
es: Solicitud de amistad ha fallado
ru: Невозможно добавить контакт

# TOX_ERR_FRIEND_BY_PUBLIC_KEY_NOT_FOUND
source: TOX_ERR_FRIEND_BY_PUBLIC_KEY_NOT_FOUND No friend with the given Public Key exists on the friend list.
es: TOX_ERR_FRIEND_BY_PUBLIC_KEY_NOT_FOUND No existe un amigo con la clave pública que figura en la lista de amigos.
ru: TOX_ERR_FRIEND_BY_PUBLIC_KEY_NOT_FOUND Контакт с данным публичным ключом отсутствут в контакт-листе.

# TOX_ERR_FRIEND_GET_LAST_ONLINE_FRIEND_NOT_FOUND
source: TOX_ERR_FRIEND_GET_LAST_ONLINE_FRIEND_NOT_FOUND No friend with the given number exists on the friend list.
es: TOX_ERR_FRIEND_GET_LAST_ONLINE_FRIEND_NOT_FOUND No existe ningún amigo con el número que figura en la lista de amigos.
ru: TOX_ERR_FRIEND_GET_LAST_ONLINE_FRIEND_NOT_FOUND Контакт с данным номером отсутствует в контакт-листе.

# TOX_ERR_FRIEND_GET_PUBLIC_KEY_FRIEND_NOT_FOUND
source: TOX_ERR_FRIEND_GET_PUBLIC_KEY_FRIEND_NOT_FOUND No friend with the given number exists on the friend list.
es: TOX_ERR_FRIEND_GET_PUBLIC_KEY_FRIEND_NOT_FOUND No existe ningún amigo con el número que figura en la lista de amigos.
ru: TOX_ERR_FRIEND_GET_PUBLIC_KEY_FRIEND_NOT_FOUND Клиент с данным номером отсутствует в контакт-листе.

# TOX_ERR_FRIEND_QUERY_NULL
source: TOX_ERR_FRIEND_QUERY_NULL The pointer parameter for storing the query result (name, message) was NULL. Unlike the `_self_` variants of these functions, which have no effect when a parameter is NULL, these functions return an error in that case.
es: TOX_ERR_FRIEND_QUERY_NULL El parámetro de puntero para almacenar el resultado de la consulta (nombre, mensaje) era NULL. A diferencia de los variantes `_self_` de estas funciones, que no tienen efecto cuando un parámetro es NULL, estas funciones devuelven un error en ese caso.

# TOX_ERR_FRIEND_SEND_MESSAGE_EMPTY
source: TOX_ERR_FRIEND_SEND_MESSAGE_EMPTY Attempted to send a zero-length message.
es: TOX_ERR_FRIEND_SEND_MESSAGE_EMPTY Intento de enviar un mensaje de longitud cero.
ru: TOX_ERR_FRIEND_SEND_MESSAGE_EMPTY Попытка отправить пустое сообщение.

# TOX_ERR_FRIEND_SEND_MESSAGE_FRIEND_NOT_CONNECTED
source: TOX_ERR_FRIEND_SEND_MESSAGE_FRIEND_NOT_CONNECTED This client is currently not connected to the friend.
es: TOX_ERR_FRIEND_SEND_MESSAGE_FRIEND_NOT_CONNECTED Este cliente actualmente no está conectado a su amigo.
ru: TOX_ERR_FRIEND_SEND_MESSAGE_FRIEND_NOT_CONNECTED Нет связи с контактом.

# TOX_ERR_FRIEND_SEND_MESSAGE_FRIEND_NOT_FOUND
source: TOX_ERR_FRIEND_SEND_MESSAGE_FRIEND_NOT_FOUND The friend number did not designate a valid friend.
es: TOX_ERR_FRIEND_SEND_MESSAGE_FRIEND_NOT_FOUND El número de amigo no designa un amigo válido.
ru: TOX_ERR_FRIEND_SEND_MESSAGE_FRIEND_NOT_FOUND Номер контакта неверен.

# TOX_ERR_FRIEND_SEND_MESSAGE_SENDQ
source: TOX_ERR_FRIEND_SEND_MESSAGE_SENDQ An allocation error occurred while increasing the send queue size.
es: TOX_ERR_FRIEND_SEND_MESSAGE_SENDQ Se ha producido un error de asignación de tiempo que aumenta el tamaño de la cola de envío.
ru: TOX_ERR_FRIEND_SEND_MESSAGE_SENDQ Ошибка выделения памяти при увеличении размера очереди отправки.

# TOX_ERR_FRIEND_SEND_MESSAGE_TOO_LONG
source: TOX_ERR_FRIEND_SEND_MESSAGE_TOO_LONG Message length exceeded TOX_MAX_MESSAGE_LENGTH.
es: TOX_ERR_FRIEND_SEND_MESSAGE_TOO_LONG Longitud del mensaje excedida TOX_MAX_MESSAGE_LENGTH.
ru: TOX_ERR_FRIEND_SEND_MESSAGE_TOO_LONG Длина сообщения не может привышать TOX_MAX_MESSAGE_LENGTH.

# TOX_ERR_NEW_LOAD_BAD_FORMAT
source: TOX_ERR_NEW_LOAD_BAD_FORMAT he data format was invalid. This can happen when loading data that was saved by an older version of Tox, or when the data has been corrupted. When loading from badly formatted data, some data may have been loaded, and the rest is discarded. Passing an invalid length parameter also causes this error.
es: TOX_ERR_NEW_LOAD_BAD_FORMAT el formato de datos no es válido. Esto puede suceder cuando se cargan los datos que se guardó por una versión anterior de Tox, o cuando los datos se han corrompido. Al cargar a partir de datos mal formateados, algunos datos pueden haber sido cargado, y el resto es desechado. Pasando un parámetro de longitud no válida también causa este error.
ru: TOX_ERR_NEW_LOAD_BAD_FORMAT Неверные данные. Такое случается при попытке загрузить данные которые повреждены или сохранены в старой версии Tox. При загрузке неверных данных некоторая часть информации может быть загружена, а остальная часть отброшена. Также передача неверного параметра длины может вызвать эту ошибку.

# TOX_ERR_NEW_LOAD_ENCRYPTED
source: TOX_ERR_NEW_LOAD_ENCRYPTED The byte array to be loaded contained an encrypted save.
es: TOX_ERR_NEW_LOAD_ENCRYPTED La matriz de bytes para ser cargado contenía Parada cifrada.
ru: TOX_ERR_NEW_LOAD_ENCRYPTED Массив данных для загрузки зашифрован.

# TOX_ERR_NEW_MALLOC
source: TOX_ERR_NEW_MALLOC The function was unable to allocate enough memory to store the internal structures for the Tox object
es: TOX_ERR_NEW_MALLOC La función no pudo asignar memoria suficiente para almacenar las estructuras internas para el objeto Tox
ru: TOX_ERR_NEW_MALLOC Функция не смогла выделить достаточно памяти для хранения внутренних структур Tox-объекта

# TOX_ERR_NEW_PORT_ALLOC
source: TOX_ERR_NEW_PORT_ALLOC The function was unable to bind to a port. This may mean that all ports have already been bound, e.g. by other Tox instances, or it may mean a permission error. You may be able to gather more information from errno.
es: TOX_ERR_NEW_PORT_ALLOC La función era incapaz de unirse a un puerto. Esto puede significar que todos los puertos ya se han unido, por ejemplo, por otras instancias Tox, o puede significar un error de permiso. Usted puede obtener más información en el código de error.
ru: TOX_ERR_NEW_PORT_ALLOC Функция не смогла привязаться к порту. Такое может случиться при недостатке прав или если ко всем портам уже кто-то привязался, например, другие запущенные экземпляры Tox. Вы можете получить больше информации из кода ошибки.

# TOX_ERR_NEW_PROXY_BAD_HOST
source: TOX_ERR_NEW_PROXY_BAD_HOST proxy_type was valid but the proxy_host passed had an invalid format or was NULL.
es: TOX_ERR_NEW_PROXY_BAD_HOST PROXY_TYPE correcta, pero proxy_host es NULL o esta mal formado
ru: TOX_ERR_NEW_PROXY_BAD_HOST Правильный proxy_type, но proxy_host равен NULL или имеет неверный формат.

# TOX_ERR_NEW_PROXY_BAD_PORT
source: TOX_ERR_NEW_PROXY_BAD_PORT proxy_type was valid, but the proxy_port was invalid.
es: TOX_ERR_NEW_PROXY_BAD_PORT PROXY_TYPE correcto, pero proxy_port no valido.
ru: TOX_ERR_NEW_PROXY_BAD_PORT Правильный proxy_type, но неверный proxy_port.

# TOX_ERR_NEW_PROXY_NOT_FOUND
source: TOX_ERR_NEW_PROXY_NOT_FOUND The proxy host passed could not be resolved.
es: TOX_ERR_NEW_PROXY_NOT_FOUND Esta dirección de servidor proxy no se encuentra.
ru: TOX_ERR_NEW_PROXY_NOT_FOUND Указанный адрес прокси-сервера не найден.

# TOX_ERR_OPTIONS_NEW_MALLOC
source: TOX_ERR_OPTIONS_NEW_MALLOC The function failed to allocate enough memory for the options struct.
es: TOX_ERR_OPTIONS_NEW_MALLOC La función no pudo asignar suficiente memoria para la estructura opciones.
ru: TOX_ERR_OPTIONS_NEW_MALLOC Функция не смогла выделить достаточно памяти для внутренноего объекта настроек.

# TOX_ERR_SET_INFO_TOO_LONG
source: TOX_ERR_SET_INFO_TOO_LONG Information length exceeded maximum permissible size.
es: TOX_ERR_SET_INFO_TOO_LONG La longitud excede el tamaño máximo permitido.
ru: TOX_ERR_SET_INFO_TOO_LONG Превышена длина допустимого размера информации.

# TOX_ERR_SET_TYPING_FRIEND_NOT_FOUND
source: TOX_ERR_SET_TYPING_FRIEND_NOT_FOUND The friend number did not designate a valid friend.
es: TOX_ERR_SET_TYPING_FRIEND_NOT_FOUND Número de PIN no válido.
ru: TOX_ERR_SET_TYPING_FRIEND_NOT_FOUND Неверный номер контакта.

# TRANSLATION_CHECKER
source: Okay
es: Ok

source: Username
es: Nombre
ru: Имя

# PROFILE_ABORT
source: Abort
ru: Выход

# TOX_ERR_FRIEND_QUERY_FRIEND_NOT_FOUND
source: TOX_ERR_FRIEND_QUERY_FRIEND_NOT_FOUND The friend_number did not designate a valid friend.
ru: TOX_ERR_FRIEND_QUERY_FRIEND_NOT_FOUND Номер контакта неверен.
